Revit 2024 API
ParameterTypeId.AlignmentStationLabelSetInterval Property
 "Alignment Station Label Set Interval": The text is not used directly anywhere in the UI, instead the XAML specifies its own string for the value's label.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId AlignmentStationLabelSetInterval { get; }
Visual Basic
Public Shared ReadOnly Property AlignmentStationLabelSetInterval As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ AlignmentStationLabelSetInterval {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace